Revit 2024 API
CanExecuteEventArgs Methods
The CanExecuteEventArgs type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSelectedCategoryIds
Gets the category ids of selected elements.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace